> Hello, @varshatumburu , I didn't update the resource. Instead, I created the resource.
> 
> This is the request:
> 
> ```
> POST /v1/projects/ci-test-project-188019/locations/me-west1-b/privateClouds?alt=json&privateCloudId=tf-test-sample-pcer48vrygfc HTTP/1.1
> Host: vmwareengine.googleapis.com
> User-Agent: Terraform/1.8.3 (+https://www.terraform.io) Terraform-Plugin-SDK/2.33.0 terraform-provider-google-
> 
> {
>  "description": "sample updated description",
>  "managementCluster": {
>   "autoscalingSettings": {
>    "autoscalingPolicies": {
>     "autoscaling-policy": {
>      "consumedMemoryThresholds": {
>       "scaleIn": 20,
>       "scaleOut": 75
>      },
>      "cpuThresholds": {
>       "scaleIn": 15,
>       "scaleOut": 80
>      },
>      "nodeTypeId": "standard-72",
>      "scaleOutSize": 1,
>      "storageThresholds": {
>       "scaleIn": 20,
>       "scaleOut": 80
>      }
>     }
>    },
>    "maxClusterNodeCount": 8,
>    "minClusterNodeCount": 3
>   },
>   "clusterId": "tf-test-sample-mgmt-cluster-custom-core-counter48vrygfc",
>   "nodeTypeConfigs": {
>    "standard-72": {
>     "customCoreCount": 32,
>     "nodeCount": 3
>    }
>   }
>  },
>  "networkConfig": {
>   "managementCidr": "192.168.0.0/24",
>   "vmwareEngineNetwork": "projects/ci-test-project-188019/locations/global/vmwareEngineNetworks/tf-test-pc-nw-er48vrygfc"
>  }
> }
> ```
> 
> The error I got for the test is that
> 
> ```
> error=
>   | After applying this test step, the plan was not empty.
>   | stdout:
>   | 
>   | 
>   | Terraform used the selected providers to generate the following execution
>   | plan. Resource actions are indicated with the following symbols:
>   |   ~ update in-place
>   |  <= read (data resources)
>   | 
>   | Terraform will perform the following actions:
>   | 
>   |   # data.google_vmwareengine_nsx_credentials.nsx-ds will be read during apply
>   |   # (depends on a resource or a module with changes pending)
>   |  <= data "google_vmwareengine_nsx_credentials" "nsx-ds" {
>   |       + id       = (known after apply)
>   |       + parent   = "projects/ci-test-project-188019/locations/me-west1-b/privateClouds/tf-test-sample-pcer48vrygfc"
>   |       + password = (known after apply)
>   |       + username = (known after apply)
>   |     }
>   | 
>   |   # data.google_vmwareengine_private_cloud.ds will be read during apply
>   |   # (depends on a resource or a module with changes pending)
>   |  <= data "google_vmwareengine_private_cloud" "ds" {
>   |       + deletion_delay_hours              = (known after apply)
>   |       + description                       = (known after apply)
>   |       + hcx                               = (known after apply)
>   |       + id                                = (known after apply)
>   |       + location                          = "me-west1-b"
>   |       + management_cluster                = (known after apply)
>   |       + name                              = "tf-test-sample-pcer48vrygfc"
>   |       + network_config                    = (known after apply)
>   |       + nsx                               = (known after apply)
>   |       + send_deletion_delay_hours_if_zero = (known after apply)
>   |       + state                             = (known after apply)
>   |       + type                              = (known after apply)
>   |       + uid                               = (known after apply)
>   |       + vcenter                           = (known after apply)
>   |     }
>   | 
>   |   # data.google_vmwareengine_vcenter_credentials.vcenter-ds will be read during apply
>   |   # (depends on a resource or a module with changes pending)
>   |  <= data "google_vmwareengine_vcenter_credentials" "vcenter-ds" {
>   |       + id       = (known after apply)
>   |       + parent   = "projects/ci-test-project-188019/locations/me-west1-b/privateClouds/tf-test-sample-pcer48vrygfc"
>   |       + password = (known after apply)
>   |       + username = (known after apply)
>   |     }
>   | 
>   |   # google_vmwareengine_private_cloud.vmw-engine-pc will be updated in-place
>   |   ~ resource "google_vmwareengine_private_cloud" "vmw-engine-pc" {
>   |         id                                = "projects/ci-test-project-188019/locations/me-west1-b/privateClouds/tf-test-sample-pcer48vrygfc"
>   |         name                              = "tf-test-sample-pcer48vrygfc"
>   |         # (10 unchanged attributes hidden)
>   | 
>   |       ~ management_cluster {
>   |             # (1 unchanged attribute hidden)
>   | 
>   |           + autoscaling_settings {
>   |               + max_cluster_node_count = 8
>   |               + min_cluster_node_count = 3
>   | 
>   |               + autoscaling_policies {
>   |                   + autoscale_policy_id = "autoscaling-policy"
>   |                   + node_type_id        = "standard-72"
>   |                   + scale_out_size      = 1
>   | 
>   |                   + consumed_memory_thresholds {
>   |                       + scale_in  = 20
>   |                       + scale_out = 75
>   |                     }
>   | 
>   |                   + cpu_thresholds {
>   |                       + scale_in  = 15
>   |                       + scale_out = 80
>   |                     }
>   | 
>   |                   + storage_thresholds {
>   |                       + scale_in  = 20
>   |                       + scale_out = 80
>   |                     }
>   |                 }
>   |             }
>   | 
>   |             # (1 unchanged block hidden)
>   |         }
>   | 
>   |         # (1 unchanged block hidden)
>   |     }
>   | 
>   | Plan: 0 to add, 1 to change, 0 to destroy.
> ```
> 
> I didn't see other errors.

Autoscaling settings will not get added to the cluster without cool down period. Although some are optional fields in the proto, all fields (policy, min, max node count, cool down period) are mandatory for successful addition of autoscaling settings. Please retry by adding cool down period and let me know if you are facing the same issue.